Author: R.Charumathi

Bootcamp: Python and Data Analysis, ShapeAI

Project: Titanic_survivors project

In [1]:
#importing the necessary libraries of python
import numpy as np
import pandas as pd

In [2]:
#readingh data using pandas
df=pd.read_csv('train')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
#shape of the dataset
df.shape

(891, 12)

In [5]:
#description of dataframe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
#size of dataframe
size=df.shape[0]*df.shape[1]
print ('size:',size)
df.size

size: 10692

10692

In [7]:
#counting null values in each column
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
a=df.isnull().sum()
a
thir_five=int(35/100*df.shape[0])
print(thir_five)

311

In [12]:
#find the columns to be dropped when it has more than 15% missing value of dataset
drop_col=a[a>(15/100*df.shape[0])]

In [13]:
drop_col

Age      177
Cabin    687
dtype: int64

In [14]:
#index of column to be dropped
drop_col.index

Index(['Age', 'Cabin'], dtype='object')

In [15]:
#drop the column that selected
df.drop(drop_col.index,axis=1,inplace=True)

In [16]:
#check the null values in each column again
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [17]:
#fill the missing values with mean values
df.fillna(df.mean(),inplace=True)

In [18]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [19]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [20]:
#fill the missing values of embarked column with 'S' as it is top value of that column
df['Embarked'].fillna('S',inplace=True)

In [21]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [22]:
#correlation between all columns
df.corr()

             PassengerId  Survived    Pclass     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144 -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481 -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  0.083081  0.018443 -0.549500
SibSp          -0.057527 -0.035322  0.083081  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  0.159651  0.216225  1.000000

In [23]:
#Familysize column is sum of both values of sibsp and parch columns
df['FamilySize']=df['SibSp']+df['Parch']

In [24]:
#dropping the sibsp and parch columns
df.drop(['SibSp','Parch'],axis=1,inplace=True)

In [25]:
#correlation between columns
df.corr()

             PassengerId  Survived    Pclass      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.549500    0.065997
Fare            0.012658  0.257307 -0.549500  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997  0.217138    1.000000

In [26]:
#Alone column has 0 value if familySize has more than value 0 otherwise 1
df['Alone']=[0 if df['FamilySize'][i]>0 else 1  for i in df.index]

In [27]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Ticket,Fare,Embarked,FamilySize,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,A/5 21171,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,71.2833,C,1,0
2,3,1,3,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,7.9250,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,53.1000,S,1,0
4,5,0,3,"Allen, Mr. William Henry",male,373450,8.0500,S,0,1

In [28]:
#Alone column here to be group by survived
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [29]:
#correlation between Alone and fare
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [30]:
#Column sex can has 0 value if male otherwise it can have value 1
df['Sex']=[0 if df['Sex'][i]=='male' else 1 for i in df.index]

In [31]:
#Sex column values to be Grouped by mean of survived rate
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [32]:
#Embarked Column's values to be grouped by mean of survived rate
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

 Conclusion:

1.Female passengers were prioritised over men
2.People with high class or rich people have higher survival rage than others. Hierarchy might have been followed while saving the passengers. 3.Passengers traveling with thier family have higher survival rate.
3.Passengers who bored the embarked the ship at Cherbourg survived rate is high. 5.Alone people has less survival rate than people with family.